import ab1Image from './images/ab1.png';
import ab2Image from './images/ab2.png';
import ab3Image from './images/ab3.png';
import ab4Image from './images/ab4.png';
import ab5Image from './images/ab5.png';
import ar1Image from './images/ar1.png';
import ar2Image from './images/ar2.png';
import ar3Image from './images/ar3.png';
import ar4Image from './images/ar4.png';
import c1Image from './images/c1.png';
import c2Image from './images/c2.png';
import c3Image from './images/c3.png';
import c4Image from './images/c4.png';
import c5Image from './images/c5.png';
import l1Image from './images/l1.png';
import l2Image from './images/l2.png';
import l3Image from './images/l3.png';
import l4Image from './images/l4.png';
import l5Image from './images/l5.png';
import s1Image from './images/s1.png';
import s2Image from './images/s2.png';
import s3Image from './images/s3.png';
import s4Image from './images/s4.png';
import s5Image from './images/s5.png';
import s6Image from './images/s6.png';
import s7Image from './images/s7.png';
import p1Image from './images/p1.jpg';
import l1Video from './videos/l1.mp4';
import p1Video from './videos/p1.mp4';
export const detailImageMap = 
{
    "ab1": ab1Image,
    "ab2": ab2Image,
    "ab3": ab3Image,
    "ab4": ab4Image,
    "ab5": ab5Image,
    "ar1": ar1Image,
    "ar2": ar2Image,
    "ar3": ar3Image,
    "ar4": ar4Image,
    "c1": c1Image,
    "c2": c2Image,
    "c3": c3Image,
    "c4": c4Image,
    "c5": c5Image,
    "l1": l1Image,
    "l2": l2Image,
    "l3": l3Image,
    "l4": l4Image,
    "l5": l5Image,
    "s1": s1Image,
    "s2": s2Image,
    "s3": s3Image,
    "s4": s4Image,
    "s5": s5Image,
    "s6": s6Image,
    "s7": s7Image,
    "p1": p1Image,
}
export const detailVideoMap = 
{
    "l1": l1Video,
    "p1": p1Video
}
export const detailContents = {
    "default": {
        "name": "預設",
        "name_en": "Default",
        "preAction": [
            {
                "main": "",
                "tips": ""
            }
        ],
        "action": [
            {
                "main": "",
                "tips": ""
            }
        ],
        "partsTrained": [],
        "tools": [],
        "caution": [
            {
                "main":"",
                "tips":""
            }
        ]
    },
"ab1": {
    "name": "仰臥起坐",
    "name_en": "Sit Up",
    "preAction": [
        {
            "main": "腳底平放在地上，兩膝分開與肩同寬，膝部屈曲約90度，膝蓋彎曲，避免腰背部受傷。根據腹肌的力量而決定雙手擺放的位置，雙手越靠頭部越吃力。初期把手靠於身體兩側，漸入佳境後，可以把手交叉貼於胸前或耳側。",
            "tips": "固定或按住腳踝時，切勿過度用力， 避免使用到大腿和髖部的屈肌，反而降低腹部肌肉的消耗量"
        }
    ],
    "action": [
        {
            "main": "正常呼吸，當身體向上坐起時，呼氣，這樣可運動到腹部較深層的肌肉。",
            "tips": "做仰臥起坐的速度宜緩慢，就如慢動作般； 不宜動作太快，避免拉傷腹肌"
        },
        {
            "main": "身體離地15~30公分後，應稍作停頓並收緊腹部肌肉。",
            "tips": ""
        },
        {
            "main": "吸氣同時背部慢慢貼回地面，回復原位，背部著地時， 便可以開始下一個仰臥起坐，如此循環動作。",
            "tips": ""
        }
    ],
    "partsTrained": ["上腹直肌、下腹直肌為主", "兩側的腹斜肌為輔"],
    "tools": [],
    "caution": [
        {
            "main":"初學者要避免一次做太多，可以從一組5下開始做起，然後每回多加一下，直到每回可以做15下一組，再慢慢進展至可以做達3組",
            "tips":""
        },
        {
            "main":"不須勉強手肘去碰觸膝蓋，以免對頸椎造成傷害，引起神經壓迫",
            "tips":""
        },
        {
            "main":"不宜強迫轉動身體",
            "tips":"右手手肘接觸左膝，左手手肘接觸右膝等動作",
        },
        {
            "main":"對增強腹部肌肉力量無顯著幫助，且讓下背因壓迫受傷",
            "tips":"",
        }
    ]
},
"ab2": {
    "name": "棒式",
    "name_en": "Plank",
    "preAction": [
        {
            "main": "膝蓋跪地，手臂彎曲，放低肘部至地面，手肘位於肩部正下方，手掌可握拳或打開貼地。",
            "tips": "手臂位置垂直於地面"
        }
    ],
    "action": [
        {
            "main": "雙腳分次向後踩，伸直雙腿，呈現平板式。",
            "tips": "雙腳距離微寬來穩固"
        },
        {
            "main": "腹肌和臀大肌用力收緊，臀部與肩部呈一直線，視線停留在手上，脖子維持自然穩定姿勢。",
            "tips": "身體從頭到腳跟成一直線，保持頸椎中立"
        },
        {
            "main": "肩部向後用力縮緊，股四頭肌和雙腳保持放鬆。",
            "tips": "為身體製造張力，可在同一個姿勢上維持更久，想像正把手肘和腳尖拉向彼此，大腿中間也用力夾著一顆球"
        },
        {
            "main": "深呼吸，維持上述姿勢越久越好，注意臀部不要翹起或下垂。",
            "tips": ""
        }
    ],
    "partsTrained": ["腹橫肌", "多裂肌(下背部分)"],
    "tools": [],
    "caution": [
        {
            "main":"一組至少做30~40秒",
            "tips":""
        }
    ]
},

"ab3": {
    "name": "登山式",
    "name_en": "Mountain Climber",
    "preAction": [
        {
            "main": "雙腳打開與肩同寬，呈高平板式的姿勢，背部不應拱起。",
            "tips": ""
        },
        {
            "main": "全程視線往下，保持頸部放鬆；肩膀要在手腕正上方； 穩定核心，使肩部到臀部、腳跟成一直線。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "左腳彎曲觸碰左肘（或往胸部靠近），接著快速退回高平板姿勢。",
            "tips": ""
        },
        {
            "main": "右腳彎曲觸碰右肘（或往胸部靠近），接著快速退回高平板姿勢。",
            "tips": ""
        },
        {
            "main": "左右輪替做。",
            "tips": ""
        }
    ],
    "partsTrained": ["肱三頭肌", "三角肌", "背部", "核心肌群", "髖屈肌", "股四頭肌", "膕繩肌", "臀部"],
    "tools": ["平坦地面"],
    "caution": [
        {
            "main":"腳趾需觸及地面",
            "tips":""
        },
        {
            "main":"不低頭看腳",
            "tips":""
        },
        {
            "main":"讓核心肌肉穩定身體，不用腳趾頭彈跳",
            "tips":""
        }
    ]
},
"ab4": {
    "name": "單車式捲腹",
    "name_en": "Bicycle Crunch",
    "preAction": [
        {
            "main": "平躺於地面，雙手抱頭，腰臀貼緊地面，雙腳抬起呈90度，預備踩腳踏車動作。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "上半身以肩膀帶動向右旋轉，右腳彎曲碰至右左手手肘，左腳伸直，勿觸碰地面。",
            "tips": "以核心抬起上身，切勿用以雙手將身體拉起，易造成頸部受傷"
        },
        {
            "main": "上半身以肩膀帶動向左旋轉，左腳彎曲碰至右手手肘，右腳伸直，下肋骨與骨盆保持貼地，勿晃動。",
            "tips": "轉體時上半身注意不要抬得太高"
        }
    ],
    "partsTrained": ["腹直肌", "腹外斜肌"],
    "tools": ["平坦地面(有墊子佳)"],
    "caution": [
        {
            "main":"初學者可以讓下方腳彎曲踩在地面，能更加輕鬆地完成，再慢慢進階。",
            "tips":""
        }
    ]
},
"ab5": {
    "name": "仰臥抬腿",
    "name_en": "Leg Raise",
    "preAction": [
        {
            "main": "平躺於平坦地面或墊子上，雙腳併攏伸直。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "腹肌核心收緊，利用下腹肌的力量帶動雙腳。",
            "tips": "若動作時感覺到下背有明顯拉力， 易受傷，須著重學習如何用腹肌的下半部出力"
        },
        {
            "main": "腿部抬升至屁股略微離開地面，同時吸氣，短暫停留後緩慢下放，同時吐氣。",
            "tips": "注意勿讓腰部離開地板， 且大腿放下時勿放得太低，讓腰部不會騰空即可"
        }
    ],
    "partsTrained": ["下腹肌群"],
    "tools": ["平坦地面(瑜珈墊佳)"],
    "caution": [
        {
            "main":"初學者抬起大腿時，可微彎膝蓋，因腿伸越直，負重越重",
            "tips":""
        }
    ]
},
"ar1": {
    "name": "二頭彎舉",
    "name_en": "Biceps Curl",
    "preAction": [
        {
            "main": "站立時雙腳打開與髖部同寬，膝蓋放鬆微彎，雙臂置於身體兩側，雙手各握住一個啞鈴。肩膀往後收並往下放，收緊腹肌，準備開始。",
            "tips": "只要肩胛骨向後收緊即可，不要過度往後擠壓背部，甚至是拱腰，易受傷"
        }
    ],
    "action": [
        {
            "main": "手肘緊靠身體兩側，位置剛好落在胸腔前側，掌心翻轉向上朝外，這個動作叫做外旋，同時將啞鈴向肩膀彎舉，舉到最高點時，把二頭肌完全收緊。",
            "tips": "啞鈴彎舉的速度不要太快，將你的身體保持直立，避免使用三角肌前束來代償"
        },
        {
            "main": "往反方向運動，掌心內旋，回到起始姿勢，這樣算完成 1 次。",
            "tips": ""
        },
        {
            "main": "重複同樣動作，確保不是透過擺動或晃動身體來出力產生動能。",
            "tips": ""
        }
    ],
    "partsTrained": ["二頭肌為主", "三頭肌、前三角肌、核心為輔"],
    "tools": ["啞鈴(控制度最佳之重量)"],
    "caution": [
        {
            "main":"啞鈴挑選 :",
            "tips":""
        },
        {
            "main":"新手 : 建議從單手3～8％體重的重量開始(ex:體重70公斤，單手拿2~5公斤)",
            "tips":""
        },
        {
            "main":"有運動基礎 : 建議從單手8~10％體重的重量開始(ex:體重70公斤，單手拿5~7公斤)",
            "tips":""
        }
    ]
},
"ar2": {
    "name": "三頭屈伸",
    "name_en": "Seated Dumbbell Tricep Extension",
    "preAction": [
        {
            "main": "坐在椅子上，先用雙手把啞鈴拿起，放在膝蓋上。",
            "tips": ""
        },
        {
            "main": "把啞鈴用腳輔助，踢到肩膀上穩定放著。",
            "tips": "不過度聳肩，影響訓練效果"
        }
    ],
    "action": [
        {
            "main": "雙手舉起啞鈴，將手臂彎曲，手肘緊貼在頭部側邊，啞鈴置於頭部後方，此時為起始位置。",
            "tips": "手肘不宜過度彎曲，避免受傷"
        },
        {
            "main": "慢慢地抬起啞鈴，伸直手臂，直到啞鈴在頭部正上方，此時為結束位置。",
            "tips": "手肘盡量打直，確保訓練效果，但不宜過度伸直，避免受傷"
        },
        {
            "main": "暫停一下，然後慢慢地放下啞鈴，回到起始位置，並重複以上動作。",
            "tips": "肩關節不前後晃動，下背不過度彎曲避免下背壓力，保持順暢呼吸不憋氣"
        }
    ],
    "postAction":[
        {
            "main": "把啞鈴先放回肩膀旁。",
            "tips": ""
        },
        {
            "main": "另一隻手到前面接啞鈴，並放回腿上。",
            "tips": ""
        }
    ],
    "partsTrained": ["肱三頭肌"],
    "tools": ["啞鈴(控制度最佳之重量)", "臥推椅(或有高度且可躺之平面)"],
    "caution": [
        {
            "main":"",
            "tips":""
        }
    ]
},
"ar3": {
    "name": "錘式彎舉",
    "name_en": "Hammer Curl",
    "preAction": [
        {
            "main": "選擇站姿、坐姿。後挺胸收腹，腰背挺直，雙手自然握持啞鈴下垂於身體兩側，身體勿晃動。",
            "tips": "站姿:自然站立，雙腳與肩同寬，核心保持穩定；坐姿:背部貼緊椅背"
        },
        {
            "main": "手肘貼著身體，掌心相對。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "上臂固定不動，收縮肱二頭肌將啞鈴潮間部方向向上彎舉，同時呼氣。直到肱二頭肌收縮至極限，啞鈴與肩同高。",
            "tips": ""
        },
        {
            "main": "在頂端短暫停留，感受肱二頭肌的收縮，緩慢將啞鈴下放回起始位置，同時吸氣，反覆進行。",
            "tips": ""
        }
    ],
    "partsTrained": ["肱橈肌為主", "肱二頭肌、肱肌、前臂伸肌和前臂屈肌為輔"],
    "tools": ["啞鈴(控制度最佳之重量)"],
    "caution": [
        {
            "main":"動作時肩膀勿借到力",
            "tips":""
        }
    ]
},
"ar4": {
    "name": "俯身啞鈴臂屈伸",
    "name_en": "Tricep Dumbbell Kickback",
    "preAction": [
        {
            "main": "雙手各持一啞鈴，膝蓋微彎，彎腰使上半身向前傾， 核心收緊，背部挺直，直到上半身與地面接近平行。",
            "tips": ""
        },
        {
            "main": "上臂緊貼上身，與地面平行，前臂自然下垂，抬頭面向前。",
            "tips": "不過度聳肩"
        }
    ],
    "action": [
        {
            "main": "上臂固定不動，使用肱三頭肌的力量將啞鈴向後舉起，同時呼氣，直到上臂與地面平行，在頂端短暫停留，感受肱三頭肌的收縮。",
            "tips": "確保上臂固定，不往下掉且上臂夾緊身體，下臂伸的時候不要帶動上臂"
        },
        {
            "main": "後上臂固定不動，緩慢下放啞鈴，同時吸氣，反覆進行。",
            "tips": ""
        }
    ],
    "partsTrained": ["肱三頭肌為主", "三角肌為輔"],
    "tools": ["啞鈴"],
    "caution": [
        {
            "main":"也可使用平板凳使單腳跪於上方，一手撐著平板凳保持平衡，一手持啞鈴進行訓練",
            "tips":""
        }
    ]
},
"c1": {
    "name": "啞鈴臥推",
    "name_en": "Bench Press",
    "preAction": [
        {
            "main": "選好適合的啞鈴後，坐上臥推椅，握住啞鈴中心位置，將啞鈴垂直放在雙腿接近膝蓋的地方。接著順勢往後躺，雙腿輔助啞鈴推到預備位置。",
            "tips": "手腕盡可能控制在肉墊位置，不過度彎折，否則易受傷"
        },
        {
            "main": "挺胸，讓啞鈴的重量經由手腕、手肘，傳導到背部穩定住。腹肌出力，穩定好你的核心肌群。腳踩的位置盡量靠近身體，屁股繃緊。",
            "tips": "收緊肩胛，下壓斜方肌，不要挺肚子放鬆、不要折腰"
        }
    ],
    "action": [
        {
            "main": "吸一小口氣，將啞鈴下放到胸線兩側，啞鈴略呈八字較佳。",
            "tips": "略低於乳頭連線，盡量維持在45°夾角，最舒服且胸肌感受度最高"
        },
        {
            "main": "吐氣，推到頂端，手肘打直，把胸肌收縮到最緊，到最有緊繃感的位置即可。",
            "tips": "推起時，不要聳肩，肩膀應該都是固定下壓的，聳肩代表啞鈴太重"
        },
        {
            "main": "吸氣，搭配呼吸核心繃緊，啞鈴下放到胸線位置。",
            "tips": "啞鈴不過度下放，可能造成肩膀代償拉傷"
        },
    ],
    "partsTrained": ["胸大肌為主", "前三角肌、肱三頭肌、核心肌群為輔"],
    "tools": ["啞鈴(控制度最佳之重量)", "臥推椅(或有高度且可躺之平面)"],
    "caution": [
        {
            "main":"啞鈴挑選 :",
            "tips":""
        },
        {
            "main":"新手 : 建議從單手10～15％體重的重量開始(ex:體重60公斤，單手拿8公斤)",
            "tips":""
        },
        {
            "main":"有運動基礎 : 建議從單手20％體重的重量開始(ex:體重70公斤，單手拿14公斤)",
            "tips":""
        }
    ]
},
"c2": {
    "name": "啞鈴上夾胸",
    "name_en": "Dumbbell Inclined Bench Fly",
    "preAction": [
        {
            "main": "雙手持啞鈴坐在臥推椅上，雙腳平均落在地面，接著慢慢躺平，手肘打直，挺胸縮小腹。",
            "tips": "使用啞鈴雙手緊握，食指可以穩定啞鈴，讓它不搖晃"
        }
    ],
    "action": [
        {
            "main": "雙手平行上舉。",
            "tips": ""
        },
        {
            "main": "吸氣，雙手手肘微彎並緩緩打開，展開同時將啞鈴對準自己的心窩，緩慢向兩側下降。下降到與身體平行即可。",
            "tips": "下降的程度會因每個人肩關節柔軟度不同而有差異，以自己感覺舒適為主"
        },
        {
            "main": "雙手將啞鈴夾回胸部上方，最後一刻手肘伸直，完成動作。",
            "tips": ""
        }
    ],
    "partsTrained": ["胸大肌", "前三角肌"],
    "tools": ["啞鈴(控制度最佳之重量)", "臥推椅(或有高度且可躺之平面)"],
    "caution": [
        {
            "main":"初學階段建議手肘從開始到結束，都維持固定角度，避免用到錯誤的肌群",
            "tips":""
        },
        {
            "main":"啞鈴飛鳥使用到的關節很多，所以在訓練過程中，記得收緊屁股與核心、挺胸以避免磨損肩關節、韌帶拉傷，甚至是肩峰韌帶纖維化等傷害發生",
            "tips":""
        }
    ]
},
"c3": {
    "name": "窄距上斜胸推",
    "name_en": "Close Grip Dumbbell Inclined Chest Press",
    "preAction": [
        {
            "main": "仰臥在可調節斜度的長椅上，頭部處於高位",
            "tips": "長椅傾角30-60度"
        },
        {
            "main": "雙手正握啞鈴，握距在25-30CM之間",
            "tips": "窄距"
        },
        {
            "main": "頭、肩、髖、左腳、右腳 5點固定",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "將啞鈴高舉位於肩膀上方。",
            "tips": "兩手持鈴應平行於肩"
        },
        {
            "main": "吸氣時將啞鈴往下放到肩膀外側，吐氣時將啞鈴往上推至起始位置，反覆進行。",
            "tips": "前臂之間的夾角應該是低於90°的"
        }
    ],
    "partsTrained": ["胸大肌上部為主", "肱三頭肌、三角肌前束、前鋸肌和胸骨小肌為輔"],
    "tools": ["啞鈴", "臥推椅"],
    "caution": [
        {
            "main":"謹記胸部訓練動作的本質為「夾」",
            "tips":""
        },
        {
            "main":"訓練時同樣需要胸部要挺起，兩肩要下沉，切忌「含胸聳肩」",
            "tips":""
        }
    ]
},
"c4": {
    "name": "仰臥屈臂上拉",
    "name_en": "Dumbbell Pullover",
    "preAction": [
        {
            "main": "橫臥在長凳上，挺胸收腹，身體與凳呈十字交叉，上背放在凳上，肩與凳邊齊平， 頭及下半身懸於凳外，雙腳平放地上，以保持身體穩定。",
            "tips": "保持臀部位置平行於地面"
        },
        {
            "main": "兩臂彎曲，雙手以垂直地面方式握住啞鈴上面那端的槓片， 手臂伸直於胸前，手肘微彎，掌心向上，啞鈴下垂。",
            "tips": "手不必緊握啞鈴"
        }
    ],
    "action": [
        {
            "main": "吸氣，擴展胸廓，同時緩慢地將啞鈴向頭頂處儘可能下放，並固定身體。",
            "tips": "外放手肘的同時，肩部於手部呈穩定且鎖定的姿勢， 為胸大肌提供更多伸展張力"
        },
        {
            "main": "逐漸下放啞鈴直到上臂處於水平位置。",
            "tips": "下落時用胸大肌及闊背肌的力量緩慢下放，避免受傷"
        },
        {
            "main": "當啞鈴降至最低位置時，即用胸大肌和背闊肌的力量將啞鈴沿著原路舉起，直到雙臂伸直於胸前，反覆進行。",
            "tips": ""
        }
    ],
    "partsTrained": ["胸大肌、闊背肌、後三角肌為主", "大圓肌、肱三頭肌長頭為輔"],
    "tools": ["啞鈴", "臥推椅"],
    "caution": [
        {
            "main":"儘量使用身體的力量，而非手臂的力量把啞鈴拉起來",
            "tips":""
        },
        {
            "main":"屬於較高階訓練，需要肩部與肩胛骨穩定，若有相關部位受傷應避免進行此動作",
            "tips":""
        }
    ]
},
"c5": {
    "name": "平躺啞鈴飛鳥",
    "name_en": "Dumbbell Flye",
    "preAction": [
        {
            "main": "平躺於地面上，同時挺胸。",
            "tips": ""
        },
        {
            "main": "肩胛骨後收，確保肩胛骨穩定、不聳肩，腰部與地面間留至少一個拳頭的空間。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "雙手平行上舉，雙手手肘微彎並緩緩打開。",
            "tips": ""
        },
        {
            "main": "雙手向外畫圓展開，緩慢向兩側下降，下降到與身體平行的位置，伸展的同時吸氣。",
            "tips": "下降的程度以自己舒適為主"
        },
        {
            "main": "雙手將啞鈴夾回胸部上方",
            "tips": "全程維持手肘微彎角度並收緊核心挺胸"
        },
        {
            "main": "最後一刻將雙手手肘伸直，反覆進行，回復起始動作時吐氣。",
            "tips": ""
        },
    ],
    "partsTrained": ["胸大肌、前三角肌為主", "肱橈肌、三頭肌、二頭肌、前鋸肌、闊背肌為輔"],
    "tools": ["啞鈴","平坦地面"],
    "caution": [
        {
            "main":"此動作不需使用大重量啞鈴",
            "tips":""
        },
        {
            "main":"若發現動作後手部痠痛程度大於胸大肌，則需減輕啞鈴重量，著重於胸大肌的感受度",
            "tips":""
        }
    ]
},
"l1": {
    "name": "徒手深蹲",
    "name_en": "Squat",
    "preAction": [
        {
            "main": "雙腳打開與肩同寬，腳尖向前微微往外，雙手則可放在胸前交叉交疊或是雙手握拳。",
            "tips": "膝蓋保持向前和腳趾頭對齊，避免膝蓋扭曲而受傷"
        },
        {
            "main": "腳底平放於地面，將重心放在雙腳上。",
            "tips": "重心集中放在整個腳底板上"
        }
    ],
    "action": [
        {
            "main": "吸氣，尾骨往內收，臀部像坐椅子一樣，往下坐。",
            "tips": "脊椎保持筆直，避免在起身時或是重心向下移時往前傾斜， 維持上半身挺胸有助於保持平衡，降低脊椎拉傷的風險"
        },
        {
            "main": "收緊臀部，吐氣，腳根站穩回到站姿。",
            "tips": ""
        }
    ],
    "partsTrained": ["股四頭肌、縫匠肌（大腿前側）、股二頭肌、半腱肌（大腿後側），臀大肌（屁股）、腓腸肌（小腿）為主", "腿部穩定肌群為輔"],
    "tools": [],
    "caution": [
        {
            "main":"膝蓋與腳尖同方向，雙腳掌可嘗試平行或外八等不同站姿去感受大腿受力",
            "tips":""
        }
    ]
},
"l2": {
    "name": "前跨蹲",
    "name_en": "Forward Lunge",
    "preAction": [
        {
            "main": "挺身站立，雙腳打開與髖部同寬，手臂放在兩側後。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "往前跨出一隻腳時，核心出力並將雙手叉腰，雙腳屈膝直到 90 度角的姿勢，確保前膝沒有超過前腳趾。",
            "tips": "跨步時以「臀部」發力，且身體保持中立，不要過度前傾或後仰，後腳盡量不跪地"
        },
        {
            "main": "將重量放在前腿上，後腿只需維持平衡並保持挺胸，透過前腳往下踩來回到起始姿勢。",
            "tips": ""
        },
        {
            "main": "換腳，重複上述動作。",
            "tips": ""
        }
    ],
    "partsTrained": ["臀大肌", "股四頭肌", "大腿後側肌群", "小腿肌"],
    "tools": [],
    "caution": [
        {
            "main":"步距不宜過大",
            "tips":""
        },
        {
            "main":"膝蓋不宜超過腳尖",
            "tips":""
        },{
            "main":"膝蓋指向前方",
            "tips":""
        },
        {
            "main":"雙腳與髖部同寬",
            "tips":""
        }
    ]
},
"l3": {
    "name": "啞鈴羅馬尼亞硬舉",
    "name_en": "Dumbbell Romanian Deadlift",
    "preAction": [
        {
            "main": "雙手各持一啞鈴，身體直立，挺胸收腹，面向前，雙手自然下垂，掌心朝向大腿。",
            "tips": ""
        },
        {
            "main": "雙腳開立，與肩同寬，膝蓋微彎。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "上腰部彎曲，臀部向後推做髖關節絞鍊。",
            "tips": "屁股向後推，並讓軀幹向前傾"
        },
        {
            "main": "背部挺直，將啞鈴順著腿前緩慢下放，同時吸氣， 膝蓋隨著啞鈴下降逐漸彎曲，直到感覺大腿後側拉伸至極限。",
            "tips": "啞鈴下放速度不宜過快，易受傷且降低腿後腱肌群的感受度，最底端只需低於膝蓋，呈半蹲姿勢，下放位置不須過低，易使腰椎後凸代償受傷"
        },
        {
            "main": "伸展臀部及腰部，返回起始位置，同時呼氣，反覆進行。",
            "tips": "起身的過程同樣保持背部挺直"
        }
    ],
    "partsTrained": ["腿後側(股二頭肌)為主", "臀部、前臂、上半身核心、上背、下背為輔"],
    "tools": ["啞鈴"],
    "caution": [
        {
            "main":"膝關節不宜過度伸直，會導致膝關節壓力過大",
            "tips":""
        },
        {
            "main":"駝背、拱腰會導致脊椎不中立，易受傷且影響訓練成效",
            "tips":""
        },
        {
            "main":"腰椎不須過於前凸，易受傷",
            "tips":""
        },
        {
            "main":"膝蓋內夾造成膝蓋內側的壓迫，易受傷",
            "tips":""
        }
    ]
},
"l4": {
    "name": "啞鈴保加利亞單腿蹲",
    "name_en": "Dumbbell Bulgarian Split Squat",
    "preAction": [
        {
            "main": "雙手各持一啞鈴，視線朝前、背部水平不駝背、 肩膀自然下沉不聳肩、膝蓋保持中立不內夾、腳掌貼平地面。",
            "tips": ""
        },
        {
            "main": "選擇膝蓋高度的平台，背對平台，將右腿抬起，腳背平放在平台上，腳背貼平椅墊。",
            "tips": "勿把小腿也放上椅墊，會縮短動作行程"
        },
        {
            "main": "調整身體與平台適中站距",
            "tips": "臀部落座於板凳1/2 2.其中一腿伸直，腳要緊貼地面 3.站起後就是最適合保加利亞深蹲練臀的腿距"
        },
        {
            "main": "下蹲時膝蓋呈現約90°~120°，且膝蓋不超過腳尖。",
            "tips": "膝蓋超過腳尖太多，易受傷"
        }
    ],
    "action": [
        {
            "main": "保持身體姿勢、身體前傾，前腳順勢向下蹲，蹲至前腳大腿平行地面、膝蓋靠近地面的高度，膝蓋朝前，下肢穩定。",
            "tips": "因每個人活動度不同，蹲到後腳膝蓋整個碰地或懸空都可以，以前腳為主"
        },
        {
            "main": "短暫停留後上升回預備動作，反覆進行。",
            "tips": "膝蓋朝前，下肢穩定，上半身挺直，腹部出力，不塌腰"
        }
    ],
    "partsTrained": ["股四頭肌為主", "臀部肌群、腿後肌群、腓腸肌、比目魚肌、髖關節 / 膝關節 / 踝關節為輔"],
    "tools": ["啞鈴", "平板凳"],
    "caution": [
        {
            "main":"建議先習慣徒手訓練後，再加上啞鈴",
            "tips":""
        },
        {
            "main":"若有下背、腰部疼痛問題的話，不建議使用槓鈴，易受傷",
            "tips":""
        },
        {
            "main":"任何穩固的平面皆可使用，高度約在膝蓋附近，依照自己做保加利亞深蹲的感受度，再微調略高或略低",
            "tips":""
        }
    ]
},
"l5": {
    "name": "俯臥啞鈴腿彎舉",
    "name_en": "Prone Dumbbell Leg Curl",
    "preAction": [
        {
            "main": "選擇適當重量啞鈴放置地面。",
            "tips": ""
        },
        {
            "main": "趴在啞鈴前方，雙腳放在啞鈴柄的兩側。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "雙腳將啞鈴夾起，兩腿伸直，小腿懸空。",
            "tips": ""
        },
        {
            "main": "股二頭肌發力，朝臀部方向儘可能地彎曲膝蓋至極限。",
            "tips": "腳底始終朝天花板，重量彎舉到臀部上方的時候，避免臀部向上抬起"
        },
        {
            "main": "短暫停留後，緩慢下放，在啞鈴快要碰到地面之前停住，反覆進行。",
            "tips": ""
        }
    ],
    "partsTrained": ["股二頭肌為主", "內收肌、臀部肌肉為輔"],
    "tools": ["啞鈴", "平板凳", "平坦地面"],
    "caution": [
        {
            "main":"全程注意力須保持集中，避免啞鈴掉落造成受傷",
            "tips":""
        },
        {
            "main":"若有安全疑慮或無法受啞鈴重量可用於瑜珈球代替",
            "tips":""
        },
        {
            "main":"若需加強訓練效果建議使用平板凳進行動作，可讓腿完全伸直，獲得更大刺激",
            "tips":""
        }
    ]
},
"s1": {
    "name": "啞鈴肩推",
    "name_en": "Dumbbell Shoulder Press",
    "preAction": [
        {
            "main": "上抬啞鈴，將啞鈴垂直放在大腿前段靠近膝蓋的位置。左右腿往上蹬，將啞鈴推到手部可以發力的位置，再用雙手一起將啞鈴上抬至起始位置，同時肩膀外旋。",
            "tips": ""
        },
        {
            "main": "上背貼於椅背，產生支撐點，吸氣收緊核心，下背挺直，不拱腰。手肘往身體內扣約 30 度，手肘指向地面且前臂與地面垂直。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "吐氣開始上推，速度放慢且保持身體穩固，感受肩膀三角肌的收縮，上抬置頂點時，手肘不要鎖死，手臂不用完全打直。",
            "tips": ""
        },
        {
            "main": "下放時吸氣，保持慢且穩，下放至最低點的高度，但不低於水平，手臂彎曲呈 90 度。",
            "tips": ""
        }
    ],
    "postAction": [
        {
            "main": "大腿上抬，讓啞鈴靠著大腿順勢接住啞鈴的重量，接住啞鈴。",
            "tips": ""
        }
    ],
    "partsTrained": ["三角肌前束、三角肌中束為主", "三角肌後束、三頭肌為輔"],
    "tools": ["啞鈴(控制度最佳之重量)", "臥推椅(一般椅建議有椅背)"],
    "caution": [
        {
            "main":"手腕盡可能控制在肉墊位置，不過度彎折，否則易受傷",
            "tips":""
        },
        {
            "main":"不過度拱腰，下背易受傷，更會導致手部的姿勢跟著錯誤",
            "tips":""
        },
        {
            "main":"執行時，手和身體平行後，再內收30～35°，手外開角度不宜過大",
            "tips":""
        },
        {
            "main":"全程手肘、肩胛骨都不要聳肩或鎖死，而隨著槓鈴的上推、下放來進行收縮",
            "tips":""
        },
        {
            "main":"啞鈴挑選 :",
            "tips":""
        },
        {
            "main":"新手 : 建議從單手5～10％體重的重量開始(ex:體重70公斤，約3～7公斤)",
            "tips":""
        },
        {
            "main":"有運動基礎 : 建議從單手10～15％體重的重量開始(ex:體重70公斤，約7～10公斤)",
            "tips":""
        }
    ]
},
"s2": {
    "name": "啞鈴前平舉",
    "name_en": "Dumbbell Front Raise",
    "preAction": [
        {
            "main": "下肢：保持膝蓋微彎、彈性",
            "tips": ""
        },
        {
            "main": "腹部：出力收緊，使身體穩定",
            "tips": ""
        },
        {
            "main": "胸口：挺胸，使胸椎自然挺出",
            "tips": ""
        },
        {
            "main": "背部：保持穩定即可，不必刻意站很直",
            "tips": ""
        },
        {
            "main": "肩膀：放鬆、下沉上斜肌方，使其不過度參與",
            "tips": ""
        },
        {
            "main": "手部：雙手持啞鈴，自然下放於身體兩側",
            "tips": "不將手肘鎖死，手肘、手腕可保持微彎"
        }
    ],
    "action": [
        {
            "main": "吸氣，手臂向前伸出手掌朝下，將啞鈴向上提起並保持肘部略微彎曲， 以減輕關節的壓力。當手臂與地面大致呈水平時，短暫停留並感覺肩膀的肌肉收縮。",
            "tips": "不過度借力，維持好動作、姿勢，將啞鈴慢慢平舉"
        },
        {
            "main": "呼氣，以緩慢的動作控制手臂下降，將啞鈴恢復至大腿前方。",
            "tips": ""
        }
    ],
    "partsTrained": ["三頭肌", "二頭肌", "胸肌"],
    "tools": ["啞鈴(重量適中)"],
    "caution": [
        {
            "main":"不過度聳肩或搖擺身體，試著練習用更輕的重量、練習動作開始前放鬆肩胛",
            "tips":""
        },
        {
            "main":"啞鈴挑選 :",
            "tips":""
        },
        {
            "main":"新手建議挑選2.5~5公斤",
            "tips":""
        },
        {
            "main":"有經驗者可從5～10公斤開始",
            "tips":""
        }
    ]
},
"s3": {
    "name": "啞鈴側平舉",
    "name_en": "Dumbbell Lateral Raise",
    "preAction": [
        {
            "main": "雙腳站立與肩同寬，收腹挺胸、背部挺直，保持身體穩定。",
            "tips": ""
        },
        {
            "main": "雙手抓握啞鈴於身體兩側，手肘微彎，拳眼向前。",
            "tips": "手握在啞鈴的正中間:平均刺激三角肌的前、中、後束，握在啞鈴的後半段:著重刺激三角肌中束、後束"
        }
    ],
    "action": [
        {
            "main": "將啞鈴向兩側舉起，舉到手臂與地面平行。",
            "tips": "注意啞鈴重量不可太重、啞鈴不需握太緊，身體不需站太直並保持穩定，不過度借力、聳肩，手腕位置不應比手肘高"
        },
        {
            "main": "接著沿著原上升路徑緩慢落下。",
            "tips": ""
        }
    ],
    "partsTrained": ["三角肌前束、三角肌中束為主", "三角肌後束為輔"],
    "tools": ["啞鈴(控制度最佳之重量)"],
    "caution": [
        {
            "main":"訓練方式 :",
            "tips":"「全程下壓肩胛」的側平舉方式，建議舉起的角度可以到70～80°就好，利用最不容易代償的姿勢，換取你的側平舉活動範圍。「隨動作移動肩胛」的側平舉方式，最大的側平舉角度可以到90°，利用最大的活動度，換取可能代償的風險"
        },
        {
            "main":"啞鈴挑選 :",
            "tips":" 新手 : 建議從單手2～7％體重的重量開始(ex:體重70公斤，約2～5公斤)。有運動基礎 : 建議從單手7～10％體重的重量開始(ex:體重70公斤，約5～7公斤)"
        }
    ]
},
"s4": {
    "name": "俯身啞鈴飛鳥",
    "name_en": "Bent Over Dumbbell Flye",
    "preAction": [
        {
            "main": "雙手拿住啞鈴放於身體兩側，雙腿分開與髖同寬，腳尖向前，膝蓋和腳尖保持相同方向，髖關節中立，收腹挺胸，肩帶縮回下沉，目視前方。",
            "tips": ""
        },
        {
            "main": "腰背挺直，屈髖屈膝，向前俯身，將啞鈴下放到膝蓋前下方，上半身俯身70~80°，大腿與地面呈70°，小腿垂直地面，膝關節不超過腳尖。",
            "tips": "俯身角度最低不能低於45°，可以通過更多的屈膝角度來緩解緊繃，如果還是不行的話，建議變換動作，比如坐姿"
        },
        {
            "main": "大臂保持不動，小臂微收，肘關節約呈100~140°，掌心相對，腕關節保持中立。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "吸氣準備，呼氣，在肘關節保持不變的前提下，三角肌後束發力，帶動手臂將啞鈴提至大小臂與肩同高，大臂與肩成一條直線，腕關節保持中立，掌心向下，三角肌後束有收縮感。",
            "tips": "腰背保持挺直，肩帶縮回下沉，膝關節微屈，膝蓋不要超過腳尖，身體不要搖晃"
        },
        {
            "main": "吸氣同時三角肌控制手臂將啞鈴還原到初始位置，重複動作，呼吸速率2~4秒。",
            "tips": ""
        }
    ],
    "partsTrained": ["三角肌後束為主", "三角肌中束、斜方肌中下束、菱形肌、岡下肌、小圓肌為輔"],
    "tools": ["啞鈴"],
    "caution": [
        {
            "main":"進行時肩關節不適，常見原因 : 肩關節互動度不夠、熱身不足、啞鈴過重、肩帶沒有收緊",
            "tips":""
        },
        {
            "main":"此動作不適合使用大重量啞鈴",
            "tips":""
        }
    ]
},
"s5": {
    "name": "直立划船",
    "name_en": "Upright Row",
    "preAction": [
        {
            "main": "*開始前需要進行「自測肩關節內旋狀態下的外展活動度」:",
            "tips": "將手臂向內旋轉，然後進行外展，感受自己肩關節在哪個高度受限。在動作過程中則不建議超過此位置，通常只需使肘關節略低於肩部即可。"
        },
        {
            "main": "雙手各持一個啞鈴，身體直立。",
            "tips": "選擇合理握距，一般在1~1.5倍肩寬即可，距離過大將降低刺激效果"
        },
        {
            "main": "手臂在身前自然下垂，掌心朝向大腿。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "將啞鈴緊貼身體向上拉，肘部向身體側面彎曲，同時呼氣。整個向上拉的過程，以肘關節帶動，直至啞鈴被拉到下巴位置，肘部高於前臂。",
            "tips": "保持槓鈴緊貼身體，不要過於前伸手臂，以維持身體穩定"
        },
        {
            "main": "在頂端稍作停留，然後慢慢將啞鈴放回起始位置，同時吸氣。",
            "tips": ""
        }
    ],
    "partsTrained": ["三角肌中束為主", "背部斜方肌為輔"],
    "tools": ["啞鈴"],
    "caution": [
        {
            "main":"慎選啞鈴重量，太重可能導致肩部受傷",
            "tips":""
        },
        {
            "main":"一組次數控制在10~12次即可，次數不宜過多",
            "tips":""
        }
    ]
},
"s6": {
    "name": "阿諾肩推(坐姿版)",
    "name_en": "Arnold Press",
    "preAction": [
        {
            "main": "下肢 : 坐好椅墊，保持穩定  上肢 : 視線維持在正前方，自然挺胸收腹，兩手各握一啞鈴。",
            "tips": ""
        },
        {
            "main": "手臂在身前自然下垂，掌心朝向大腿。中下背部貼平椅背即可，上背不須。",
            "tips": "注意手腕有沒有向前凹折、向內轉動，避免手腕承受過多壓力，讓重量垂直落在前臂上"
        }
    ],
    "action": [
        {
            "main": "將啞鈴舉到肩部位置，掌心面對自己。",
            "tips": "起槓方式:將啞鈴放在大腿最前端，再利用腿部上蹬的力量將啞鈴抬起"
        },
        {
            "main": "像啞鈴推舉動作一樣向上舉，並一邊向上舉一邊旋轉手腕，以使啞鈴舉到最高點時，掌心朝前。",
            "tips": "儘量不要推到雙臂完全伸直的最高點，在肘關節伸直前就開始下放啞鈴，可加強練習效果"
        },
        {
            "main": "最高點停頓，然後用上舉相同的軌跡緩慢將啞鈴轉轉回起始位置，雙手手掌朝向自己，反覆進行。",
            "tips": "下放速度不宜太快"
        }
    ],
    "partsTrained": ["三角肌前、中束為主", "三角肌後束、肱三頭肌為輔"],
    "tools": ["啞鈴", "有椅背的椅子"],
    "caution": [
        {
            "main":"因為此動作過程肩膀不能休息，故適合作為力竭訓練",
            "tips":""
        },
        {
            "main":"肩膀、手腕有傷者不建議進行此動作",
            "tips":""
        },
        {
            "main":"站姿可練到更多核心，並使用更重重量，坐姿張力可以更集中在肩膀上，對肌肥大效果更好",
            "tips":""
        },
        {
            "main":"啞鈴挑選 :",
            "tips":"新手 : 建議2.5~5kg  有訓練基礎 : 建議從7.5~10kg  一般肩推能做到30公斤以上者，可從12～15kg的啞鈴開始練習"
        }
    ]
},
"s7": {
    "name": "過頭前平舉",
    "name_en": "Overhead Front Raise",
    "preAction": [
        {
            "main": "自然站立，兩手啞鈴垂於腿前，握距與肩同寬。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "把啞鈴向前上方舉起，直至前臂在耳朵兩旁。",
            "tips": "肘部稍彎  啞鈴勿握太緊，影響三角肌之訓練效能"
        },
        {
            "main": "緩慢將啞鈴依原路徑下放，反覆進行。",
            "tips": ""
        }
    ],
    "partsTrained": ["三角肌前束、中束"],
    "tools": ["啞鈴"],
    "caution": [
        {
            "main":"手肘可輕微彎曲，以減低重量對二頭肌的壓力",
            "tips":""
        },
        {
            "main":"此動作不適合使用大重量啞鈴。",
            "tips":""
        }
    ]
},
"p1": {
    "name": "伏地挺身",
    "name_en": "Push Up",
    "preAction": [
        {
            "main": "雙手撐地間距與肩同寬，手掌根部位大約在乳頭正下方。",
            "tips": "預備姿勢時，讓自己習慣先放鬆、下沉肩膀，不過度聳肩"
        },
        {
            "main": "屁股下壓，核心出力夾緊，保持身體軀幹呈一條斜斜向上的直線。",
            "tips": ""
        }
    ],
    "action": [
        {
            "main": "吸氣同時彎曲手肘，上半身緩慢下降，將背夾緊，胸部往地面靠近，直到手肘比背部還高的位置。 身體往下時，手肘往外呈30~45度，視線看向雙手前方。",
            "tips": "手肘的擺放角度太大會造成肩膀的代償，太小則會造成三頭肌過多的發力"
        },
        {
            "main": "吐氣同時雙手用力推地，將身體向上帶，將背打開，回到高平板撐的位置，反覆進行。",
            "tips": ""
        }
    ],
    "partsTrained": ["胸大肌", "二頭肌", "三頭肌", "三角肌", "核心肌群"],
    "tools": ["平坦地面"],
    "caution": [
        {
            "main":"伏地挺身和臥推的訓練模式很像，但這兩者卻不能互相取代，因重量的作用位置會有所不同",
            "tips":""
        },
        {
            "main":"行程完整、速度慢的伏地挺身，難度較高，次數較少，但能使胸肌得到更充分的收縮",
            "tips":""
        },
        {
            "main":"正確的伏地挺身應斜上斜下，使手腕處於最自然的狀態",
            "tips":""
        }
    ]
},

}