export const detailContents = {
    "ab1": {
        "name": "仰臥起坐",
        "name_en": "Sit Up",
        "preAction": [
            {
                "main": "腳底平放在地上，兩膝分開與肩同寬，膝部屈曲約90度，膝蓋彎曲，避免腰背部受傷。根據腹肌的力量而決定雙手擺放的位置，雙手越靠頭部越吃力。初期把手靠於身體兩側，漸入佳境後，可以把手交叉貼於胸前或耳側。",
                "tips": "固定或按住腳踝時，切勿過度用力， 避免使用到大腿和髖部的屈肌，反而降低腹部肌肉的消耗量"
            }
        ],
        "action": [
            {
                "main": "正常呼吸，當身體向上坐起時，呼氣，這樣可運動到腹部較深層的肌肉。",
                "tips": "做仰臥起坐的速度宜緩慢，就如慢動作般； 不宜動作太快，避免拉傷腹肌"
            },
            {
                "main": "身體離地15~30公分後，應稍作停頓並收緊腹部肌肉。",
                "tips": ""
            },
            {
                "main": "吸氣同時背部慢慢貼回地面，回復原位，背部著地時， 便可以開始下一個仰臥起坐，如此循環動作。",
                "tips": ""
            }
        ],
        "partsTrained": ["上腹直肌、下腹直肌為主", "兩側的腹斜肌為輔"],
        "tools": [],
        "caution": [
            {
                "main":"初學者要避免一次做太多，可以從一組5下開始做起，然後每回多加一下，直到每回可以做15下一組，再慢慢進展至可以做達3組",
                "tips":""
            },
            {
                "main":"不須勉強手肘去碰觸膝蓋，以免對頸椎造成傷害，引起神經壓迫",
                "tips":""
            },
            {
                "main":"不宜強迫轉動身體",
                "tips":"右手手肘接觸左膝，左手手肘接觸右膝等動作",
            },
            {
                "main":"對增強腹部肌肉力量無顯著幫助，且讓下背因壓迫受傷",
                "tips":"",
            }
        ]
    },
    "ab2": {
        "name": "棒式",
        "name_en": "Plank",
        "preAction": [
            {
                "main": "膝蓋跪地，手臂彎曲，放低肘部至地面，手肘位於肩部正下方，手掌可握拳或打開貼地。",
                "tips": "手臂位置垂直於地面"
            }
        ],
        "action": [
            {
                "main": "雙腳分次向後踩，伸直雙腿，呈現平板式。",
                "tips": "雙腳距離微寬來穩固"
            },
            {
                "main": "腹肌和臀大肌用力收緊，臀部與肩部呈一直線，視線停留在手上，脖子維持自然穩定姿勢。",
                "tips": "身體從頭到腳跟成一直線，保持頸椎中立"
            },
            {
                "main": "肩部向後用力縮緊，股四頭肌和雙腳保持放鬆。",
                "tips": "為身體製造張力，可在同一個姿勢上維持更久，想像正把手肘和腳尖拉向彼此，大腿中間也用力夾著一顆球"
            },
            {
                "main": "深呼吸，維持上述姿勢越久越好，注意臀部不要翹起或下垂。",
                "tips": ""
            }
        ],
        "partsTrained": ["腹橫肌", "多裂肌(下背部分)"],
        "tools": [],
        "caution": [
            {
                "main":"一組至少做30~40秒",
                "tips":""
            }
        ]
    },

}